--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/biancamanago/Dropbox/_AcademicWork/Vault/Research/- PUBLISHE
> D/GSS-Health Affair Analyses/- posted/Analyses/gss-data03-scales.log
  log type:  text
 opened on:  23 Dec 2021, 20:12:41

.  
.  version 15.1

.  set linesize 80

.  clear all

.  macro drop _all

. 
.  
.  local pgm   gss-data03-scales

.  local dte   2019-04-30

.  local who   bianca manago 

.  local tag   "`pgm'.do `who' `dte'"

.  
.  di "`tag'"
gss-data03-scales.do bianca manago 2019-04-30

.  
.  use "_data/gss-data02-examine.dta", clear 

. 
. ***************************************
. * STEP 1: Descriptive analyses        *
. ***************************************
.         gen black = .
(3,610 missing values generated)

.         replace black=1 if race==2
(542 real changes made)

.         replace black=0 if race!=2 & race!=.
(3,068 real changes made)

.         la def black 1 "black" 0 "white/other"

.         la val black black

.         fre black

black
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 white/other |       3068      84.99      84.99      84.99
        1 black       |        542      15.01      15.01     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

.         
.                 
. fre hurtself hurtoth

hurtself -- how likely x violent toward oneself
-------------------------------------------------------------------------
                            |      Freq.    Percent      Valid       Cum.
----------------------------+--------------------------------------------
Valid   1 very likely       |        935      25.90      25.90      25.90
        2 somewhat likely   |       1629      45.12      45.12      71.02
        3 not very likely   |        784      21.72      21.72      92.74
        4 not likely at all |        262       7.26       7.26     100.00
        Total               |       3610     100.00     100.00           
-------------------------------------------------------------------------

hurtoth -- how likely x violent toward other people
-------------------------------------------------------------------------
                            |      Freq.    Percent      Valid       Cum.
----------------------------+--------------------------------------------
Valid   1 very likely       |        483      13.38      13.38      13.38
        2 somewhat likely   |       1319      36.54      36.54      49.92
        3 not very likely   |       1339      37.09      37.09      87.01
        4 not likely at all |        469      12.99      12.99     100.00
        Total               |       3610     100.00     100.00           
-------------------------------------------------------------------------

. fre dectreat decmoney

dectreat -- how able is x to decide receive treatment
-----------------------------------------------------------------------
                          |      Freq.    Percent      Valid       Cum.
--------------------------+--------------------------------------------
Valid   1 very able       |        847      23.46      23.46      23.46
        2 somewhat able   |       1262      34.96      34.96      58.42
        3 not very able   |       1013      28.06      28.06      86.48
        4 not able at all |        488      13.52      13.52     100.00
        Total             |       3610     100.00     100.00           
-----------------------------------------------------------------------

decmoney -- how able is x to decide managing own money
-----------------------------------------------------------------------
                          |      Freq.    Percent      Valid       Cum.
--------------------------+--------------------------------------------
Valid   1 very able       |        825      22.85      22.85      22.85
        2 somewhat able   |       1176      32.58      32.58      55.43
        3 not very able   |       1060      29.36      29.36      84.79
        4 not able at all |        549      15.21      15.21     100.00
        Total             |       3610     100.00     100.00           
-----------------------------------------------------------------------

. fre mustmedR mustdocR musthospR

mustmedR -- Agreement with Legal Enforcement of Medication Regimine
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 no coercion |       2618      72.52      72.52      72.52
        1 coercion    |        992      27.48      27.48     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

mustdocR -- Agreement with Legal Enforcement of Doctors Visits
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 no coercion |       2388      66.15      66.15      66.15
        1 coercion    |       1222      33.85      33.85     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

musthospR -- Agreement with Legal Enforcement of Hospitalization
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 no coercion |       2354      65.21      65.21      65.21
        1 coercion    |       1256      34.79      34.79     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

. 
. gen age65 = 1 if age>=65
(2,989 missing values generated)

. replace age65=0 if age<65
(2,989 real changes made)

. la def age65 1 "Adults 65 and older" 0 "Under 65"

. la val age65 age65

. 
. **********
. /// Coercion
> **********
. gen coercion=mustmedR+mustdocR+musthospR 

. gen coercionR = .
(3,610 missing values generated)

. replace coercionR=1 if coercion!=0
(1,645 real changes made)

. replace coercionR=0 if coercion==0
(1,965 real changes made)

. 
. *label define coercion 0 "no coercion" 1 "coercion"
. label val coercionR coercion

. 
. tab coercionR coercion, m

            |                  coercion
  coercionR |         0          1          2          3 |     Total
------------+--------------------------------------------+----------
no coercion |     1,965          0          0          0 |     1,965 
   coercion |         0        490        485        670 |     1,645 
------------+--------------------------------------------+----------
      Total |     1,965        490        485        670 |     3,610 

. 
. **********
. /// Hurt
> **********
. bysort vigver: pwcorr hurtself hurtoth

--------------------------------------------------------------------------------
-> vigver = Alcohol

             | hurtself  hurtoth
-------------+------------------
    hurtself |   1.0000 
     hurtoth |   0.4413   1.0000 

--------------------------------------------------------------------------------
-> vigver = Depression

             | hurtself  hurtoth
-------------+------------------
    hurtself |   1.0000 
     hurtoth |   0.3958   1.0000 

--------------------------------------------------------------------------------
-> vigver = Schizophrenia

             | hurtself  hurtoth
-------------+------------------
    hurtself |   1.0000 
     hurtoth |   0.4612   1.0000 

--------------------------------------------------------------------------------
-> vigver = Daily Troubles

             | hurtself  hurtoth
-------------+------------------
    hurtself |   1.0000 
     hurtoth |   0.6467   1.0000 

--------------------------------------------------------------------------------
-> vigver = Drug Problem

             | hurtself  hurtoth
-------------+------------------
    hurtself |   1.0000 
     hurtoth |   0.4954   1.0000 

. gen hurt_x = hurtself + hurtoth if hurtselfR!=. & hurtselfR!=.

. 
. gen hurt = hurtselfR + hurtothR if hurtselfR!=. & hurtselfR!=.

. fre hurt

hurt
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |        920      25.48      25.48      25.48
        1     |       1014      28.09      28.09      53.57
        2     |       1676      46.43      46.43     100.00
        Total |       3610     100.00     100.00           
-----------------------------------------------------------

. *revrs hurt, replace
. 
. gen hurtR = .
(3,610 missing values generated)

. replace hurtR=1 if hurt!=0
(2,690 real changes made)

. replace hurtR=0 if hurt==0
(920 real changes made)

. fre hurtR

hurtR
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |        920      25.48      25.48      25.48
        1     |       2690      74.52      74.52     100.00
        Total |       3610     100.00     100.00           
-----------------------------------------------------------

. 
. **********
. /// Competence
> **********
. bysort vigver: pwcorr dectreat decmoney

--------------------------------------------------------------------------------
-> vigver = Alcohol

             | dectreat decmoney
-------------+------------------
    dectreat |   1.0000 
    decmoney |   0.5682   1.0000 

--------------------------------------------------------------------------------
-> vigver = Depression

             | dectreat decmoney
-------------+------------------
    dectreat |   1.0000 
    decmoney |   0.5712   1.0000 

--------------------------------------------------------------------------------
-> vigver = Schizophrenia

             | dectreat decmoney
-------------+------------------
    dectreat |   1.0000 
    decmoney |   0.6985   1.0000 

--------------------------------------------------------------------------------
-> vigver = Daily Troubles

             | dectreat decmoney
-------------+------------------
    dectreat |   1.0000 
    decmoney |   0.6438   1.0000 

--------------------------------------------------------------------------------
-> vigver = Drug Problem

             | dectreat decmoney
-------------+------------------
    dectreat |   1.0000 
    decmoney |   0.5495   1.0000 

. gen incompetence_x = dectreatR + decmoneyR if dectreatR!=. & decmoneyR!=.

. 
. gen incompetenceR = .
(3,610 missing values generated)

. replace incompetenceR=0 if incompetence_x==2
(1,720 real changes made)

. replace incompetenceR=1 if incompetence_x<2
(1,890 real changes made)

. fre incompetenceR

incompetenceR
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |       1720      47.65      47.65      47.65
        1     |       1890      52.35      52.35     100.00
        Total |       3610     100.00     100.00           
-----------------------------------------------------------

. 
. label define incomp 0 "Competent" 1 "Incompetent"

. label val incompetenceR incomp

. fre incompetenceR

incompetenceR
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 Competent   |       1720      47.65      47.65      47.65
        1 Incompetent |       1890      52.35      52.35     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

. 
. gen competence = dectreat + decmoney if dectreat!=. & decmoney!=.

. revrs competence, replace

. hist competence
(bin=35, start=1, width=.17142857)

. 
. gen competence_x = dectreatR + decmoneyR if dectreatR!=. & decmoneyR!=.

. gen competenceR = .
(3,610 missing values generated)

. replace competenceR=1 if competence_x==2
(1,720 real changes made)

. replace competenceR=0 if competence_x<2
(1,890 real changes made)

. fre competenceR

competenceR
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |       1890      52.35      52.35      52.35
        1     |       1720      47.65      47.65     100.00
        Total |       3610     100.00     100.00           
-----------------------------------------------------------

. 
. label define compR 1 "Competent" 0 "Incompetent"

. label val competenceR compR

. fre competenceR

competenceR
-------------------------------------------------------------------
                      |      Freq.    Percent      Valid       Cum.
----------------------+--------------------------------------------
Valid   0 Incompetent |       1890      52.35      52.35      52.35
        1 Competent   |       1720      47.65      47.65     100.00
        Total         |       3610     100.00     100.00           
-------------------------------------------------------------------

. 
. 
. tab competence incompetenceR, m

           |     incompetenceR
competence | Competent  Incompete |     Total
-----------+----------------------+----------
         1 |         0        336 |       336 
         2 |         0        241 |       241 
         3 |         0        733 |       733 
         4 |         0        512 |       512 
         5 |       766         68 |       834 
         6 |       338          0 |       338 
         7 |       616          0 |       616 
-----------+----------------------+----------
     Total |     1,720      1,890 |     3,610 

. 
. ****************************************************************
. // 
. ****************************************************************
.  alpha vigsoc vignei vigfrnd vigwork viggrp vigmar, gen(socdist)

Test scale = mean(unstandardized items)

Average interitem covariance:     .4402989
Number of items in the scale:            6
Scale reliability coefficient:      0.8605

. 
.  gen viglabelR = .
(3,610 missing values generated)

.  replace viglabelR=0 if viglabel==1 | viglabel==2
(92 real changes made)

.  replace viglabelR=1 if viglabel==3 | viglabel==4
(1,528 real changes made)

.  
. ****************************************************************
. // 
. // 
. **************************************************************** 
. 
. save "_data/gss-data03-scales", replace
file _data/gss-data03-scales.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/biancamanago/Dropbox/_AcademicWork/Vault/Research/- PUBLISHE
> D/GSS-Health Affair Analyses/- posted/Analyses/gss-data03-scales.log
  log type:  text
 closed on:  23 Dec 2021, 20:12:42
--------------------------------------------------------------------------------
